olegator1506/audio/progs/esp32-adau/include/my-project2_IC_1_REG.h
/* Plaback Mixer Right Control 0  - Registers (IC 1) */
#define REG_PLABACK_MIXER_RIGHT_CONTROL_0_IC_1_ADDR 0x401E
#define REG_PLABACK_MIXER_RIGHT_CONTROL_0_IC_1_BYTE 1
#define REG_PLABACK_MIXER_RIGHT_CONTROL_0_IC_1_VALUE 0x41

/* Playback Mixer Right Control 1  - Registers (IC 1) */
#define REG_PLAYBACK_MIXER_RIGHT_CONTROL_1_IC_1_ADDR 0x401F
#define REG_PLAYBACK_MIXER_RIGHT_CONTROL_1_IC_1_BYTE 1
#define REG_PLAYBACK_MIXER_RIGHT_CONTROL_1_IC_1_VALUE 0x0

/* Playback LR Left  - Registers (IC 1) */
#define REG_PLAYBACK_LR_LEFT_IC_1_ADDR            0x4020
#define REG_PLAYBACK_LR_LEFT_IC_1_BYTE            1
#define REG_PLAYBACK_LR_LEFT_IC_1_VALUE           0x0

/* Playback LR Right  - Registers (IC 1) */
#define REG_PLAYBACK_LR_RIGHT_IC_1_ADDR           0x4021
#define REG_PLAYBACK_LR_RIGHT_IC_1_BYTE           1
#define REG_PLAYBACK_LR_RIGHT_IC_1_VALUE          0x0

/* Playback LR Mono Ctrl  - Registers (IC 1) */
#define REG_PLAYBACK_LR_MONO_CTRL_IC_1_ADDR       0x4022
#define REG_PLAYBACK_LR_MONO_CTRL_IC_1_BYTE       1
#define REG_PLAYBACK_LR_MONO_CTRL_IC_1_VALUE      0x1

/* Playback Headphone Left  - Registers (IC 1) */
#define REG_PLAYBACK_HEADPHONE_LEFT_IC_1_ADDR     0x4023
#define REG_PLAYBACK_HEADPHONE_LEFT_IC_1_BYTE     1
#define REG_PLAYBACK_HEADPHONE_LEFT_IC_1_VALUE    0xE7

/* Playback Headphone Right  - Registers (IC 1) */
#define REG_PLAYBACK_HEADPHONE_RIGHT_IC_1_ADDR    0x4024
#define REG_PLAYBACK_HEADPHONE_RIGHT_IC_1_BYTE    1
#define REG_PLAYBACK_HEADPHONE_RIGHT_IC_1_VALUE   0xE7

/* Playback Line Out Left  - Registers (IC 1) */
#define REG_PLAYBACK_LINE_OUT_LEFT_IC_1_ADDR      0x4025
#define REG_PLAYBACK_LINE_OUT_LEFT_IC_1_BYTE      1
#define REG_PLAYBACK_LINE_OUT_LEFT_IC_1_VALUE     0x0

/* Playback Line Out Right  - Registers (IC 1) */
#define REG_PLAYBACK_LINE_OUT_RIGHT_IC_1_ADDR     0x4026
#define REG_PLAYBACK_LINE_OUT_RIGHT_IC_1_BYTE     1
#define REG_PLAYBACK_LINE_OUT_RIGHT_IC_1_VALUE    0x0

/* Playback Line Out Mono  - Registers (IC 1) */
#define REG_PLAYBACK_LINE_OUT_MONO_IC_1_ADDR      0x4027
#define REG_PLAYBACK_LINE_OUT_MONO_IC_1_BYTE      1
#define REG_PLAYBACK_LINE_OUT_MONO_IC_1_VALUE     0xE5

/* Playback Control  - Registers (IC 1) */
#define REG_PLAYBACK_CONTROL_IC_1_ADDR            0x4028
#define REG_PLAYBACK_CONTROL_IC_1_BYTE            1
#define REG_PLAYBACK_CONTROL_IC_1_VALUE           0x0

/* Playback Power Management  - Registers (IC 1) */
#define REG_PLAYBACK_POWER_MANAGEMENT_IC_1_ADDR   0x4029
#define REG_PLAYBACK_POWER_MANAGEMENT_IC_1_BYTE   1
#define REG_PLAYBACK_POWER_MANAGEMENT_IC_1_VALUE  0x3

/* DAC Control 0  - Registers (IC 1) */
#define REG_DAC_CONTROL_0_IC_1_ADDR               0x402A
#define REG_DAC_CONTROL_0_IC_1_BYTE               1
#define REG_DAC_CONTROL_0_IC_1_VALUE              0x3

/* DAC Control 1  - Registers (IC 1) */
#define REG_DAC_CONTROL_1_IC_1_ADDR               0x402B
#define REG_DAC_CONTROL_1_IC_1_BYTE               1
#define REG_DAC_CONTROL_1_IC_1_VALUE              0x0

/* DAC Control 2  - Registers (IC 1) */
#define REG_DAC_CONTROL_2_IC_1_ADDR               0x402C
#define REG_DAC_CONTROL_2_IC_1_BYTE               1
#define REG_DAC_CONTROL_2_IC_1_VALUE              0x0

/* Serial Port Pad Control 0  - Registers (IC 1) */
#define REG_SERIAL_PORT_PAD_CONTROL_0_IC_1_ADDR   0x402D
#define REG_SERIAL_PORT_PAD_CONTROL_0_IC_1_BYTE   1
#define REG_SERIAL_PORT_PAD_CONTROL_0_IC_1_VALUE  0xAA

/* Comm Port Pad Ctrl 0  - Registers (IC 1) */
#define REG_COMM_PORT_PAD_CTRL_0_IC_1_ADDR        0x402F
#define REG_COMM_PORT_PAD_CTRL_0_IC_1_BYTE        1
#define REG_COMM_PORT_PAD_CTRL_0_IC_1_VALUE       0xAA

/* Comm Port Pad Ctrl 1  - Registers (IC 1) */
#define REG_COMM_PORT_PAD_CTRL_1_IC_1_ADDR        0x4030
#define REG_COMM_PORT_PAD_CTRL_1_IC_1_BYTE        1
#define REG_COMM_PORT_PAD_CTRL_1_IC_1_VALUE       0x0

/* JackRegister  - Registers (IC 1) */
#define REG_JACKREGISTER_IC_1_ADDR                0x4031
#define REG_JACKREGISTER_IC_1_BYTE                1
#define REG_JACKREGISTER_IC_1_VALUE               0x8

/* Dejitter Register Control  - Registers (IC 1) */
#define REG_DEJITTER_REGISTER_CONTROL_IC_1_ADDR   0x4036
#define REG_DEJITTER_REGISTER_CONTROL_IC_1_BYTE   1
#define REG_DEJITTER_REGISTER_CONTROL_IC_1_VALUE  0x3

/* CRC Ideal_1  - Registers (IC 1) */
#define REG_CRC_IDEAL_1_IC_1_ADDR                 0x40C0
#define REG_CRC_IDEAL_1_IC_1_BYTE                 1
#define REG_CRC_IDEAL_1_IC_1_VALUE                0x7F

/* CRC Ideal_2  - Registers (IC 1) */
#define REG_CRC_IDEAL_2_IC_1_ADDR                 0x40C1
#define REG_CRC_IDEAL_2_IC_1_BYTE                 1
#define REG_CRC_IDEAL_2_IC_1_VALUE                0x7F

/* CRC Ideal_3  - Registers (IC 1) */
#define REG_CRC_IDEAL_3_IC_1_ADDR                 0x40C2
#define REG_CRC_IDEAL_3_IC_1_BYTE                 1
#define REG_CRC_IDEAL_3_IC_1_VALUE                0x3

/* CRC Ideal_4  - Registers (IC 1) */
#define REG_CRC_IDEAL_4_IC_1_ADDR                 0x40C3
#define REG_CRC_IDEAL_4_IC_1_BYTE                 1
#define REG_CRC_IDEAL_4_IC_1_VALUE                0x34

/* CRC Enable  - Registers (IC 1) */
#define REG_CRC_ENABLE_IC_1_ADDR                  0x40C4
#define REG_CRC_ENABLE_IC_1_BYTE                  1
#define REG_CRC_ENABLE_IC_1_VALUE                 0x1

/* GPIO 0 Control  - Registers (IC 1) */
#define REG_GPIO_0_CONTROL_IC_1_ADDR              0x40C6
#define REG_GPIO_0_CONTROL_IC_1_BYTE              1
#define REG_GPIO_0_CONTROL_IC_1_VALUE             0x0

/* GPIO 1 Control  - Registers (IC 1) */
#define REG_GPIO_1_CONTROL_IC_1_ADDR              0x40C7
#define REG_GPIO_1_CONTROL_IC_1_BYTE              1
#define REG_GPIO_1_CONTROL_IC_1_VALUE             0x0

/* GPIO 2 Control  - Registers (IC 1) */
#define REG_GPIO_2_CONTROL_IC_1_ADDR              0x40C8
#define REG_GPIO_2_CONTROL_IC_1_BYTE              1
#define REG_GPIO_2_CONTROL_IC_1_VALUE             0x0

/* GPIO 3 Control  - Registers (IC 1) */
#define REG_GPIO_3_CONTROL_IC_1_ADDR              0x40C9
#define REG_GPIO_3_CONTROL_IC_1_BYTE              1
#define REG_GPIO_3_CONTROL_IC_1_VALUE             0x0

/* Watchdog_Enable  - Registers (IC 1) */
#define REG_WATCHDOG_ENABLE_IC_1_ADDR             0x40D0
#define REG_WATCHDOG_ENABLE_IC_1_BYTE             1
#define REG_WATCHDOG_ENABLE_IC_1_VALUE            0x0

/* Watchdog Register Value 1  - Registers (IC 1) */
#define REG_WATCHDOG_REGISTER_VALUE_1_IC_1_ADDR   0x40D1
#define REG_WATCHDOG_REGISTER_VALUE_1_IC_1_BYTE   1
#define REG_WATCHDOG_REGISTER_VALUE_1_IC_1_VALUE  0x0

/* Watchdog Register Value 2  - Registers (IC 1) */
#define REG_WATCHDOG_REGISTER_VALUE_2_IC_1_ADDR   0x40D2
#define REG_WATCHDOG_REGISTER_VALUE_2_IC_1_BYTE   1
#define REG_WATCHDOG_REGISTER_VALUE_2_IC_1_VALUE  0x0

/* Watchdog Register Value 3  - Registers (IC 1) */
#define REG_WATCHDOG_REGISTER_VALUE_3_IC_1_ADDR   0x40D3
#define REG_WATCHDOG_REGISTER_VALUE_3_IC_1_BYTE   1
#define REG_WATCHDOG_REGISTER_VALUE_3_IC_1_VALUE  0x0

/* Watchdog Error  - Registers (IC 1) */
#define REG_WATCHDOG_ERROR_IC_1_ADDR              0x40D4
#define REG_WATCHDOG_ERROR_IC_1_BYTE              1
#define REG_WATCHDOG_ERROR_IC_1_VALUE             0x0

/* Non Modulo RAM 1  - Registers (IC 1) */
#define REG_NON_MODULO_RAM_1_IC_1_ADDR            0x40E9
#define REG_NON_MODULO_RAM_1_IC_1_BYTE            1
#define REG_NON_MODULO_RAM_1_IC_1_VALUE           0x10

/* Non Modulo RAM 2  - Registers (IC 1) */
#define REG_NON_MODULO_RAM_2_IC_1_ADDR            0x40EA
#define REG_NON_MODULO_RAM_2_IC_1_BYTE            1
#define REG_NON_MODULO_RAM_2_IC_1_VALUE           0x0

/* Sample Rate Setting  - Registers (IC 1) */
#define REG_SAMPLE_RATE_SETTING_IC_1_ADDR         0x40EB
#define REG_SAMPLE_RATE_SETTING_IC_1_BYTE         1
#define REG_SAMPLE_RATE_SETTING_IC_1_VALUE        0x7

/* Routing Matrix Inputs  - Registers (IC 1) */
#define REG_ROUTING_MATRIX_INPUTS_IC_1_ADDR       0x40F2
#define REG_ROUTING_MATRIX_INPUTS_IC_1_BYTE       1
#define REG_ROUTING_MATRIX_INPUTS_IC_1_VALUE      0x0

/* Routing Matrix Outputs  - Registers (IC 1) */
#define REG_ROUTING_MATRIX_OUTPUTS_IC_1_ADDR      0x40F3
#define REG_ROUTING_MATRIX_OUTPUTS_IC_1_BYTE      1
#define REG_ROUTING_MATRIX_OUTPUTS_IC_1_VALUE     0x0

/* Serial Data/GPIO Pin Config  - Registers (IC 1) */
#define REG_SERIAL_DATAGPIO_PIN_CONFIG_IC_1_ADDR  0x40F4
#define REG_SERIAL_DATAGPIO_PIN_CONFIG_IC_1_BYTE  1
#define REG_SERIAL_DATAGPIO_PIN_CONFIG_IC_1_VALUE 0x0

/* DSP Enable Register  - Registers (IC 1) */
#define REG_DSP_ENABLE_REGISTER_IC_1_ADDR         0x40F5
#define REG_DSP_ENABLE_REGISTER_IC_1_BYTE         1
#define REG_DSP_ENABLE_REGISTER_IC_1_VALUE        0x1

