olegator1506/audio/progs/esp32-adau/include/my-project2_IC_1_REG.h
/* Converter Ctrl 1 (IC 1) */
#define R19_ON_CHIP_ADC_IC_1                      0x0    /* 00b	[1:0] */
#define R19_ON_CHIP_ADC_IC_1_MASK                 0x3
#define R19_ON_CHIP_ADC_IC_1_SHIFT                0

/* ADC Control 0 (IC 1) */
#define R20_ADC_ENABLE_IC_1                       0x3    /* 11b	[1:0] */
#define R20_DIGITAL_MIC_INPUT_IC_1                0x0    /* 0b	[2] */
#define R20_DIGITAL_MIC_SWAP_IC_1                 0x0    /* 0b	[3] */
#define R20_DIGITAL_MIC_POLARITY_IC_1             0x1    /* 1b	[4] */
#define R20_HIGH_PASS_SELECT_IC_1                 0x0    /* 0b	[5] */
#define R20_INVERT_IN_POLARITY_IC_1               0x0    /* 0b	[6] */
#define R20_ADC_ENABLE_IC_1_MASK                  0x3
#define R20_ADC_ENABLE_IC_1_SHIFT                 0
#define R20_DIGITAL_MIC_INPUT_IC_1_MASK           0x4
#define R20_DIGITAL_MIC_INPUT_IC_1_SHIFT          2
#define R20_DIGITAL_MIC_SWAP_IC_1_MASK            0x8
#define R20_DIGITAL_MIC_SWAP_IC_1_SHIFT           3
#define R20_DIGITAL_MIC_POLARITY_IC_1_MASK        0x10
#define R20_DIGITAL_MIC_POLARITY_IC_1_SHIFT       4
#define R20_HIGH_PASS_SELECT_IC_1_MASK            0x20
#define R20_HIGH_PASS_SELECT_IC_1_SHIFT           5
#define R20_INVERT_IN_POLARITY_IC_1_MASK          0x40
#define R20_INVERT_IN_POLARITY_IC_1_SHIFT         6

/* ADC Control 1 (IC 1) */
#define R21_ADC_LEFT_DIGITAL_ATTENUATOR_IC_1      0x00   /* 00000000b	[7:0] */
#define R21_ADC_LEFT_DIGITAL_ATTENUATOR_IC_1_MASK 0xFF
#define R21_ADC_LEFT_DIGITAL_ATTENUATOR_IC_1_SHIFT 0

/* ADC Control 2 (IC 1) */
#define R22_ADC_RIGHT_DIGITAL_ATTENUATOR_IC_1     0x00   /* 00000000b	[7:0] */
#define R22_ADC_RIGHT_DIGITAL_ATTENUATOR_IC_1_MASK 0xFF
#define R22_ADC_RIGHT_DIGITAL_ATTENUATOR_IC_1_SHIFT 0

/* Playback Mixer Left Control 0 (IC 1) */
#define R23_PBC0_MIX_ENABLE_IC_1                  0x1    /* 1b	[0] */
#define R23_PBC0_AUX_OUT_GAIN_IC_1                0x0    /* 0000b	[4:1] */
#define R23_PBC0_LEFT_DAC_MUTE_IC_1               0x1    /* 1b	[5] */
#define R23_PBC0_RIGHT_DAC_MUTE_IC_1              0x0    /* 0b	[6] */
#define R23_PBC0_MIX_ENABLE_IC_1_MASK             0x1
#define R23_PBC0_MIX_ENABLE_IC_1_SHIFT            0
#define R23_PBC0_AUX_OUT_GAIN_IC_1_MASK           0x1E
#define R23_PBC0_AUX_OUT_GAIN_IC_1_SHIFT          1
#define R23_PBC0_LEFT_DAC_MUTE_IC_1_MASK          0x20
#define R23_PBC0_LEFT_DAC_MUTE_IC_1_SHIFT         5
#define R23_PBC0_RIGHT_DAC_MUTE_IC_1_MASK         0x40
#define R23_PBC0_RIGHT_DAC_MUTE_IC_1_SHIFT        6

/* Plaback Mixer Left Control 1 (IC 1) */
#define R24_PBC1_LEFT_PGA_GAIN_IC_1               0x0    /* 0000b	[3:0] */
#define R24_PBC1_RIGHT_PGA_GAIN_IC_1              0x0    /* 0000b	[7:4] */
#define R24_PBC1_LEFT_PGA_GAIN_IC_1_MASK          0xF
#define R24_PBC1_LEFT_PGA_GAIN_IC_1_SHIFT         0
#define R24_PBC1_RIGHT_PGA_GAIN_IC_1_MASK         0xF0
#define R24_PBC1_RIGHT_PGA_GAIN_IC_1_SHIFT        4

/* Plaback Mixer Right Control 0 (IC 1) */
#define R25_PBMRC0_ENABLE_IC_1                    0x1    /* 1b	[0] */
#define R25_PBMRC0_AUX_GAIN_IC_1                  0x0    /* 0000b	[4:1] */
#define R25_PBMRC0_L_DAC_MUTE_IC_1                0x0    /* 0b	[5] */
#define R25_PBMRC0_R_DAC_MUTE_IC_1                0x1    /* 1b	[6] */
#define R25_PBMRC0_ENABLE_IC_1_MASK               0x1
#define R25_PBMRC0_ENABLE_IC_1_SHIFT              0
#define R25_PBMRC0_AUX_GAIN_IC_1_MASK             0x1E
#define R25_PBMRC0_AUX_GAIN_IC_1_SHIFT            1
#define R25_PBMRC0_L_DAC_MUTE_IC_1_MASK           0x20
#define R25_PBMRC0_L_DAC_MUTE_IC_1_SHIFT          5
#define R25_PBMRC0_R_DAC_MUTE_IC_1_MASK           0x40
#define R25_PBMRC0_R_DAC_MUTE_IC_1_SHIFT          6

/* Playback Mixer Right Control 1 (IC 1) */
#define R26_PBMRC1_L_PGA_OUT_GAIN_IC_1            0x0    /* 0000b	[3:0] */
#define R26_PBMRC1_R_PGA_OUT_GAIN_IC_1            0x0    /* 0000b	[7:4] */
#define R26_PBMRC1_L_PGA_OUT_GAIN_IC_1_MASK       0xF
#define R26_PBMRC1_L_PGA_OUT_GAIN_IC_1_SHIFT      0
#define R26_PBMRC1_R_PGA_OUT_GAIN_IC_1_MASK       0xF0
#define R26_PBMRC1_R_PGA_OUT_GAIN_IC_1_SHIFT      4

/* Playback LR Left (IC 1) */
#define R27_PBLR_LEFT_MIX_ENABLE_IC_1             0x0    /* 0b	[0] */
#define R27_PBLR_LEFT_LEFT_MIXER_IC_1             0x0    /* 00b	[2:1] */
#define R27_PBLR_LEFT_RIGHT_MIXER_IC_1            0x0    /* 00b	[4:3] */
#define R27_PBLR_LEFT_MIX_ENABLE_IC_1_MASK        0x1
#define R27_PBLR_LEFT_MIX_ENABLE_IC_1_SHIFT       0
#define R27_PBLR_LEFT_LEFT_MIXER_IC_1_MASK        0x6
#define R27_PBLR_LEFT_LEFT_MIXER_IC_1_SHIFT       1
#define R27_PBLR_LEFT_RIGHT_MIXER_IC_1_MASK       0x18
#define R27_PBLR_LEFT_RIGHT_MIXER_IC_1_SHIFT      3

/* Playback LR Right (IC 1) */
#define R28_PBLR_RIGHT_MIX_ENABLE_IC_1            0x0    /* 0b	[0] */
#define R28_PBLR_RIGHT_LEFT_MIXER_IC_1            0x0    /* 00b	[2:1] */
#define R28_PBLR_RIGHT_RIGHT_MIXER_IC_1           0x0    /* 00b	[4:3] */
#define R28_PBLR_RIGHT_MIX_ENABLE_IC_1_MASK       0x1
#define R28_PBLR_RIGHT_MIX_ENABLE_IC_1_SHIFT      0
#define R28_PBLR_RIGHT_LEFT_MIXER_IC_1_MASK       0x6
#define R28_PBLR_RIGHT_LEFT_MIXER_IC_1_SHIFT      1
#define R28_PBLR_RIGHT_RIGHT_MIXER_IC_1_MASK      0x18
#define R28_PBLR_RIGHT_RIGHT_MIXER_IC_1_SHIFT     3

/* Playback LR Mono Ctrl (IC 1) */
#define R29_PBMONO_MIX_ENABLE_IC_1                0x1    /* 1b	[0] */
#define R29_PBMONO_LEFT_AND_RIGHT_MIXER_IC_1      0x0    /* 00b	[2:1] */
#define R29_PBMONO_MIX_ENABLE_IC_1_MASK           0x1
#define R29_PBMONO_MIX_ENABLE_IC_1_SHIFT          0
#define R29_PBMONO_LEFT_AND_RIGHT_MIXER_IC_1_MASK 0x6
#define R29_PBMONO_LEFT_AND_RIGHT_MIXER_IC_1_SHIFT 1

/* Playback Headphone Left (IC 1) */
#define R30_PB_HEADPHONE_LEFT_PWRUP_IC_1          0x1    /* 1b	[0] */
#define R30_PB_HEADPHONE_LEFT_MUTE_IC_1           0x1    /* 1b	[1] */
#define R30_PB_HEADPHONE_LEFT_VOL_IC_1            0x39   /* 111001b	[7:2] */
#define R30_PB_HEADPHONE_LEFT_PWRUP_IC_1_MASK     0x1
#define R30_PB_HEADPHONE_LEFT_PWRUP_IC_1_SHIFT    0
#define R30_PB_HEADPHONE_LEFT_MUTE_IC_1_MASK      0x2
#define R30_PB_HEADPHONE_LEFT_MUTE_IC_1_SHIFT     1
#define R30_PB_HEADPHONE_LEFT_VOL_IC_1_MASK       0xFC
#define R30_PB_HEADPHONE_LEFT_VOL_IC_1_SHIFT      2

/* Playback Headphone Right (IC 1) */
#define R31_PB_HEADPHONE_RIGHT_PWRUP_IC_1         0x1    /* 1b	[0] */
#define R31_PB_HEADPHONE_RIGHT_MUTE_IC_1          0x1    /* 1b	[1] */
#define R31_PB_HEADPHONE_RIGHT_VOL_IC_1           0x39   /* 111001b	[7:2] */
#define R31_PB_HEADPHONE_RIGHT_PWRUP_IC_1_MASK    0x1
#define R31_PB_HEADPHONE_RIGHT_PWRUP_IC_1_SHIFT   0
#define R31_PB_HEADPHONE_RIGHT_MUTE_IC_1_MASK     0x2
#define R31_PB_HEADPHONE_RIGHT_MUTE_IC_1_SHIFT    1
#define R31_PB_HEADPHONE_RIGHT_VOL_IC_1_MASK      0xFC
#define R31_PB_HEADPHONE_RIGHT_VOL_IC_1_SHIFT     2

/* Playback Line Out Left (IC 1) */
#define R32_PB_LEFT_PWRUP_IC_1                    0x0    /* 0b	[0] */
#define R32_PB_LEFT_MUTE_IC_1                     0x0    /* 0b	[1] */
#define R32_PB_LEFT_VOL_IC_1                      0x0    /* 000000b	[7:2] */
#define R32_PB_LEFT_PWRUP_IC_1_MASK               0x1
#define R32_PB_LEFT_PWRUP_IC_1_SHIFT              0
#define R32_PB_LEFT_MUTE_IC_1_MASK                0x2
#define R32_PB_LEFT_MUTE_IC_1_SHIFT               1
#define R32_PB_LEFT_VOL_IC_1_MASK                 0xFC
#define R32_PB_LEFT_VOL_IC_1_SHIFT                2

/* Playback Line Out Right (IC 1) */
#define R33_PB_RIGHT_PWRUP_IC_1                   0x0    /* 0b	[0] */
#define R33_PB_RIGHT_MUTE_IC_1                    0x0    /* 0b	[1] */
#define R33_PB_RIGHT_VOL_IC_1                     0x0    /* 000000b	[7:2] */
#define R33_PB_RIGHT_PWRUP_IC_1_MASK              0x1
#define R33_PB_RIGHT_PWRUP_IC_1_SHIFT             0
#define R33_PB_RIGHT_MUTE_IC_1_MASK               0x2
#define R33_PB_RIGHT_MUTE_IC_1_SHIFT              1
#define R33_PB_RIGHT_VOL_IC_1_MASK                0xFC
#define R33_PB_RIGHT_VOL_IC_1_SHIFT               2

