olegator1506/audio/progs/esp32-adau/include/my-project2_IC_1_REG.h
/* CRC Ideal_2 (IC 1) */
#define R46_CRC_IDEAL_2_IC_1                      0x7F   /* 01111111b	[7:0] */
#define R46_CRC_IDEAL_2_IC_1_MASK                 0xFF
#define R46_CRC_IDEAL_2_IC_1_SHIFT                0

/* CRC Ideal_3 (IC 1) */
#define R47_CRC_IDEAL_3_IC_1                      0x03   /* 00000011b	[7:0] */
#define R47_CRC_IDEAL_3_IC_1_MASK                 0xFF
#define R47_CRC_IDEAL_3_IC_1_SHIFT                0

/* CRC Ideal_4 (IC 1) */
#define R48_CRC_IDEAL_4_IC_1                      0x34   /* 00110100b	[7:0] */
#define R48_CRC_IDEAL_4_IC_1_MASK                 0xFF
#define R48_CRC_IDEAL_4_IC_1_SHIFT                0

/* CRC Enable (IC 1) */
#define R49_CRC_ENABLE_IC_1                       0x1    /* 1b	[0] */
#define R49_CRC_ENABLE_IC_1_MASK                  0x1
#define R49_CRC_ENABLE_IC_1_SHIFT                 0

/* GPIO 0 Control (IC 1) */
#define R50_GPIO_0_PIN_FUNCTION_IC_1              0x0    /* 0000b	[3:0] */
#define R50_GPIO_0_PIN_FUNCTION_IC_1_MASK         0xF
#define R50_GPIO_0_PIN_FUNCTION_IC_1_SHIFT        0

/* GPIO 1 Control (IC 1) */
#define R51_GPIO_1_PIN_FUNCTION_IC_1              0x0    /* 0000b	[3:0] */
#define R51_GPIO_1_PIN_FUNCTION_IC_1_MASK         0xF
#define R51_GPIO_1_PIN_FUNCTION_IC_1_SHIFT        0

/* GPIO 2 Control (IC 1) */
#define R52_GPIO_2_PIN_FUNCTION_IC_1              0x0    /* 0000b	[3:0] */
#define R52_GPIO_2_PIN_FUNCTION_IC_1_MASK         0xF
#define R52_GPIO_2_PIN_FUNCTION_IC_1_SHIFT        0

/* GPIO 3 Control (IC 1) */
#define R53_GPIO_3_PIN_FUNCTION_IC_1              0x0    /* 0000b	[3:0] */
#define R53_GPIO_3_PIN_FUNCTION_IC_1_MASK         0xF
#define R53_GPIO_3_PIN_FUNCTION_IC_1_SHIFT        0

/* Watchdog_Enable (IC 1) */
#define R54_WATCHDOG_ENABLE_IC_1                  0x0    /* 0b	[0] */
#define R54_WATCHDOG_ENABLE_IC_1_MASK             0x1
#define R54_WATCHDOG_ENABLE_IC_1_SHIFT            0

/* Watchdog Register Value 1 (IC 1) */
#define R55_WATCHDOG_VALUE_1_IC_1                 0x00   /* 00000000b	[7:0] */
#define R55_WATCHDOG_VALUE_1_IC_1_MASK            0xFF
#define R55_WATCHDOG_VALUE_1_IC_1_SHIFT           0

/* Watchdog Register Value 2 (IC 1) */
#define R56_WATCHDOG_VALUE_2_IC_1                 0x00   /* 00000000b	[7:0] */
#define R56_WATCHDOG_VALUE_2_IC_1_MASK            0xFF
#define R56_WATCHDOG_VALUE_2_IC_1_SHIFT           0

/* Watchdog Register Value 3 (IC 1) */
#define R57_WATCHDOG_VALUE_3_IC_1                 0x00   /* 00000000b	[7:0] */
#define R57_WATCHDOG_VALUE_3_IC_1_MASK            0xFF
#define R57_WATCHDOG_VALUE_3_IC_1_SHIFT           0

/* Watchdog Error (IC 1) */
#define R58_WATCHDOG_ERROR_STICKY_IC_1            0x0    /* 0b	[0] */
#define R58_WATCHDOG_ERROR_STICKY_IC_1_MASK       0x1
#define R58_WATCHDOG_ERROR_STICKY_IC_1_SHIFT      0

/* Non Modulo RAM 1 (IC 1) */
#define R59_NON_MODULO_1_IC_1                     0x10   /* 00010000b	[7:0] */
#define R59_NON_MODULO_1_IC_1_MASK                0xFF
#define R59_NON_MODULO_1_IC_1_SHIFT               0

/* Non Modulo RAM 2 (IC 1) */
#define R60_NON_MODULO_2_IC_1                     0x00   /* 00000000b	[7:0] */
#define R60_NON_MODULO_2_IC_1_MASK                0xFF
#define R60_NON_MODULO_2_IC_1_SHIFT               0

/* Sample Rate Setting (IC 1) */
#define R61_CORE_DSP_SAMPLING_RATE_IC_1           0x7    /* 0111b	[3:0] */
#define R61_CORE_DSP_SAMPLING_RATE_IC_1_MASK      0xF
#define R61_CORE_DSP_SAMPLING_RATE_IC_1_SHIFT     0

/* Routing Matrix Inputs (IC 1) */
#define R62_ROUTING_MATRIX_IN_IC_1                0x0    /* 0000b	[3:0] */
#define R62_ROUTING_MATRIX_IN_IC_1_MASK           0xF
#define R62_ROUTING_MATRIX_IN_IC_1_SHIFT          0

/* Routing Matrix Outputs (IC 1) */
#define R63_ROUTING_MATRIX_OUT_IC_1               0x0    /* 0000b	[3:0] */
#define R63_ROUTING_MATRIX_OUT_IC_1_MASK          0xF
#define R63_ROUTING_MATRIX_OUT_IC_1_SHIFT         0

/* Serial Data/GPIO Pin Config (IC 1) */
#define R64_GPIO_1_ENABLE_IC_1                    0x0    /* 0b	[0] */
#define R64_GPIO_0_ENABLE_IC_1                    0x0    /* 0b	[1] */
#define R64_GPIO_2_ENABLE_IC_1                    0x0    /* 0b	[2] */
#define R64_GPIO_3_ENABLE_IC_1                    0x0    /* 0b	[3] */
#define R64_GPIO_1_ENABLE_IC_1_MASK               0x1
#define R64_GPIO_1_ENABLE_IC_1_SHIFT              0
#define R64_GPIO_0_ENABLE_IC_1_MASK               0x2
#define R64_GPIO_0_ENABLE_IC_1_SHIFT              1
#define R64_GPIO_2_ENABLE_IC_1_MASK               0x4
#define R64_GPIO_2_ENABLE_IC_1_SHIFT              2
#define R64_GPIO_3_ENABLE_IC_1_MASK               0x8
#define R64_GPIO_3_ENABLE_IC_1_SHIFT              3

/* DSP Enable Register (IC 1) */
#define R65_DSP_ENABLE_IC_1                       0x1    /* 1b	[0] */
#define R65_DSP_ENABLE_IC_1_MASK                  0x1
#define R65_DSP_ENABLE_IC_1_SHIFT                 0

/* DSP Run Register (IC 1) */
#define R66_DSP_RUN_IC_1                          0x1    /* 1b	[0] */
#define R66_DSP_RUN_IC_1_MASK                     0x1
#define R66_DSP_RUN_IC_1_SHIFT                    0

/* DSP Slew Modes (IC 1) */
#define R67_HEADPHONE_LEFT_IC_1                   0x0    /* 0b	[0] */
#define R67_HEADPHONE_RIGHT_IC_1                  0x0    /* 0b	[1] */
#define R67_LINE_OUT_LEFT_IC_1                    0x0    /* 0b	[2] */
#define R67_LINE_OUT_RIGHT_IC_1                   0x0    /* 0b	[3] */
#define R67_MONO_IC_1                             0x0    /* 0b	[4] */
#define R67_HEADPHONE_LEFT_IC_1_MASK              0x1
#define R67_HEADPHONE_LEFT_IC_1_SHIFT             0
#define R67_HEADPHONE_RIGHT_IC_1_MASK             0x2
#define R67_HEADPHONE_RIGHT_IC_1_SHIFT            1
#define R67_LINE_OUT_LEFT_IC_1_MASK               0x4
#define R67_LINE_OUT_LEFT_IC_1_SHIFT              2
#define R67_LINE_OUT_RIGHT_IC_1_MASK              0x8
#define R67_LINE_OUT_RIGHT_IC_1_SHIFT             3
#define R67_MONO_IC_1_MASK                        0x10
#define R67_MONO_IC_1_SHIFT                       4

/* Serial Port Sample Rate Setting (IC 1) */
#define R68_SERIAL_PORT_SMPL_RTE_IC_1             0x0    /* 000b	[2:0] */
#define R68_SERIAL_PORT_SMPL_RTE_IC_1_MASK        0x7
#define R68_SERIAL_PORT_SMPL_RTE_IC_1_SHIFT       0

